lib/assets/print_request.xml

<SOAP-ENV:Envelope
  xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
  xmlns:ns1='http://centiro.com/facade/tmsBasic/1/0/servicecontract'
  xmlns:ns2='http://schemas.datacontract.org/2004/07/Centiro.Facade.TMSBasic.Contract.c1.i1.TMSBasic.BaseTypes.DTO'
  xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
  xmlns:ns3='http://centiro.com/facade/shared/1/0/datacontract'>
  <SOAP-ENV:Header>
    <ns3:AuthenticationTicket></ns3:AuthenticationTicket>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <ns1:AddAndPrintShipmentRequest>
      <ns1:LabelType>PDF</ns1:LabelType>
      <ns1:Shipment>
        <ns2:Addresses>
        </ns2:Addresses>
        <ns2:Attributes>
        </ns2:Attributes>
        <ns2:Currency></ns2:Currency>
        <ns2:ModeOfTransport></ns2:ModeOfTransport>
        <ns2:OrderNumber></ns2:OrderNumber>
        <ns2:Parcels>
          <ns2:Parcel>
            <ns2:OrderLines>
            </ns2:OrderLines>
            <ns2:ParcelIdentifier></ns2:ParcelIdentifier>
            <ns2:TypeOfGoods></ns2:TypeOfGoods>
            <ns2:TypeOfPackage></ns2:TypeOfPackage>
            <ns2:Value></ns2:Value>
            <ns2:Weight></ns2:Weight>
            <ns2:Width></ns2:Width>
          </ns2:Parcel>
        </ns2:Parcels>
        <ns2:SenderCode></ns2:SenderCode>
        <ns2:ShipDate></ns2:ShipDate>
        <ns2:ShipmentIdentifier></ns2:ShipmentIdentifier>
        <ns2:ShipmentType></ns2:ShipmentType>
        <ns2:TermsOfDelivery></ns2:TermsOfDelivery>
      </ns1:Shipment>
    </ns1:AddAndPrintShipmentRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>